In [1]:
import pandas as pd

In [2]:
df1= pd.DataFrame({'group': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'ounces': [4, 3, 12, 6, 7.5, 8]})

In [6]:
df1.sort_values(by=['group','ounces'], ascending=[True,False], inplace=True)
df1

  group  ounces
3     A     6.0
0     A     4.0
4     B     7.5
1     B     3.0
2     C    12.0
5     C     8.0

In [8]:
data = pd.DataFrame({'k1': ['one'] * 3 + ['two'] * 4,
                     'k2': [3, 2, 1, 3, 3, 4, 4]})
data

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
4  two   3
5  two   4
6  two   4

In [10]:
data.sort_values(by='k2')

    k1  k2
2  one   1
1  one   2
0  one   3
3  two   3
4  two   3
5  two   4
6  two   4

In [11]:
data.drop_duplicates()

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
5  two   4

In [19]:
import numpy as np

In [39]:
df2=pd.DataFrame({'data1': np.random.randn(5),
                 'data2': np.random.randn(5)})

In [41]:
df2 = df2.assign(ratio=df['data1']/df['data2'])
df2

      data1     data2     ratio
0 -0.598265  0.836004  8.045203
1  0.471023 -0.883553 -0.516192
2  0.736897 -2.140370 -6.919743
3 -0.719453  0.259467 -0.843128
4 -0.776586 -0.925700 -0.060230

In [42]:
df2.drop('ratio',axis='columns',inplace=True)

In [43]:
df2

      data1     data2
0 -0.598265  0.836004
1  0.471023 -0.883553
2  0.736897 -2.140370
3 -0.719453  0.259467
4 -0.776586 -0.925700

In [44]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [45]:
data.replace(-999.,np.nan, inplace=True)

In [46]:
data

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [47]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
bins_res = pd.cut(ages, bins)
bins_res

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [48]:
pd.value_counts(bins_res)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [ ]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']